posts/hosting-with-aws-s3-cloudfront.org
#+TITLE: Hosting with AWS S3 and CloudFront
#+DESCRIPTION: Static Site Hosting with Amazon
#+TAGS: AWS
#+TAGS: S3
#+TAGS: CloudFront
#+TAGS: Lambda
#+DATE: 2020-02-12
#+SLUG: hosting-with-aws-s3-cloudfront
#+LINK: aws https://aws.amazon.com/
#+LINK: aws-acm https://aws.amazon.com/acm/
#+LINK: aws-announce-lambda-python https://aws.amazon.com/about-aws/whats-new/2019/08/lambdaedge-adds-support-for-python-37/
#+LINK: aws-cfn-lambda-perms https://docs.aws.amazon.com/AWSCloudFormation/latest/UserGuide/aws-resource-lambda-permission.html
#+LINK: aws-cloudfront https://aws.amazon.com/cloudfront/
#+LINK: aws-cw-logs https://docs.aws.amazon.com/AmazonCloudWatch/latest/logs/WhatIsCloudWatchLogs.html
#+LINK: aws-lambda https://aws.amazon.com/lambda/
#+LINK: aws-lambda-edge https://aws.amazon.com/lambda/edge/
#+LINK: aws-lambda-edge-default-directory https://aws.amazon.com/blogs/compute/implementing-default-directory-indexes-in-amazon-s3-backed-amazon-cloudfront-origins-using-lambdaedge/
#+LINK: aws-s3 https://aws.amazon.com/s3/
#+LINK: aws-web-console https://console.aws.amazon.com/
#+LINK: blog-git https://git.devnulllabs.io/blog.kennyballou.com.git/
#+LINK: blog-home https://kennyballou.com
#+LINK: blog-infra-git https://git.devnulllabs.io/kennyballou.com.git/
#+LINK: blog-infra-uri-log-group-commit https://git.devnulllabs.io/kennyballou.com.git/commit/?id=787ab0b4b18003875346c7f9e98f1b2264fded46
#+LINK: davidbaumgold-host-s3-cloudfront https://www.davidbaumgold.com/tutorials/host-static-site-aws-s3-cloudfront/
#+LINK: debian-pandoc https://hub.docker.com/repository/docker/kennyballou/debian-pandoc
#+LINK: git https://git-scm.com/
#+LINK: github https://github.com/
#+LINK: github-actions https://help.github.com/en/actions/automating-your-workflow-with-github-actions
#+LINK: gitlab https://gitlab.com/
#+LINK: gitlab-cicd https://about.gitlab.com/stages-devops-lifecycle/continuous-integration/
#+LINK: gnu-bash https://www.gnu.org/software/bash/
#+LINK: gnu-make https://www.gnu.org/software/make/
#+LINK: ludovicroguet-host-s3-cloudfront-lambda https://fourteenislands.io/2018/03/static-website-hosting-on-aws-with-s3-cloudfront-lambda-edge/
#+LINK: pandoc https://pandoc.org/
#+LINK: python https://www.python.org/
#+LINK: rgfindl-cfn-template https://rgfindl.github.io/2017/08/07/static-website-cloudformation-template/
#+LINK: srht https://sr.ht/
#+LINK: srht-builds https://builds.sr.ht/
#+LINK: ssh https://www.ssh.com/ssh
#+LINK: ssh-config https://linux.die.net/man/5/ssh_config
#+LINK: static-site-generation https://kennyballou.com/blog/2019/03/static-site-generation
#+LINK: vickylai-host-s3-cloudfront https://vickylai.com/verbose/hosting-your-static-site-with-aws-s3-route-53-and-cloudfront/
#+LINK: wiki-cdn https://en.wikipedia.org/wiki/Content_delivery_network
#+LINK: wiki-cname-records https://en.wikipedia.org/wiki/CNAME_record
#+LINK: wiki-dns-records https://en.wikipedia.org/wiki/List_of_DNS_record_types

#+BEGIN_PREVIEW
There are many posts already out about how to host static sites in
[[aws-s3][S3]] and [[aws-cloudfront][CloudFront]].  However, I would like to
add to the discussion a small contribution of how to do this by creating the
resources in [[aws-cfn][CloudFormation]], and specifically, how to ensure all
content is served _via_ [[aws-cloudfront][CloudFront]] and is strictly not
available via [[aws-s3][S3]].
#+END_PREVIEW

** Introduction
   :PROPERTIES:
   :ID:       c5040a15-f7b4-422f-9b38-fc4bee3f10cc
   :END:

There are [[vikylai-host-s3-cloudfront][many]],
[[davidbaumgold-host-s3-cloudfront][many]]
[[ludovicroguet-host-s3-cloudfront-lambda][posts]] on hosting static sites via
[[aws-s3][S3]] and [[aws-cloudfront][CloudFront]].  There are even existing
[[aws-cfn][CloudFormation templates]] [[rgfindl-cfn-template][available]] that
can be used to make this process repeatable and consistent.

This post will simply add to this knowledge and I will attempt to capture any
notes or changes that have occurred since I ventured to migrate from managing a
virtual machine that hosts the content of this blog into [[aws-s3][S3]] served
via [[aws-cloudfront][CloudFront]].

** Overview
   :PROPERTIES:
   :ID:       43ac2a36-a5df-4fe9-847b-3c60c2165cf6
   :END:

There has been a particular evolution to hosting static sites via [[aws][AWS]]
since the company and its offerings have changed themselves.  For example, a
few years ago, the only solution was to use [[aws-s3][S3]] directly, which
meant the [[aws-s3][S3]] bucket needed to be public and the traffic could not
be encrypted.  Then, with the introduction of [[aws-cloudfront][CloudFront]],
it became possible to leverage Amazon's infrastructure to more readily
distribute content without making huge investments in private
[[wiki-cdn][content delivery networks (CDNs)]], furthermore, it soon became
possible to encrypt the traffic as well.  Finally, one of the more recent
developments is the ability to have [[aws-lambda][Lambda]] functions
distributed globally with [[aws-cloudfront][CloudFront]], making it possible to
customize or more appropriate serve the desired content.  This blog uses these
[[aws-lambda-edge][Lambda@Edge]] functions to help serve content via
[[aws-cloudfront][CloudFront]] with the files residing in [[aws-s3][S3]].

The necessity of the [[aws-lambda-edge][Lambda@Edge]] functionallity is
properly motivated by [[aws-s3][S3]]'s inability to set default documents for
each directory.  For example, if we want to serve a post like
=https://example.com/blog/year/month/post-slug/=, we are unable to since there
is no object in [[aws-s3][S3]] by that "key".  Therefore, we can use the
[[aws-lambda-edge][Lambda]] function to rewrite the URL from
[[aws-cloudfront][CloudFront]] between [[aws-s3][S3]] to retreive the
=index.html= or =/index.html= object of the folder correctly.

Another change from other posts is that this set of configuration will force
the content to be served from [[aws-cloudfront][CloudFront]].  It will not be,
or at least should not be, possible to access the content from the
[[aws-s3][S3]] bucket directly.  This serves a few purposes, the bucket does
not have to be public in any way, therefore, accidental write access is not
possible by acciendental misconfiguration.  Furthermore, all content can be
served quickly and securely because of the configuration of
[[aws-cloudfront][CloudFront]].

** CloudFormation
   :PROPERTIES:
   :ID:       2c943547-cc9e-4c40-afad-bd59e19fb043
   :END:

We'll briefly go through the various resources needed for hosting a static site
via [[aws-s3][S3]] and [[aws-cloudfront][CloudFront]].

