blog/2020/02/hosting-with-aws-s3-cloudfront/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-06-01 Sun 00:17 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Hosting with AWS S3 and CloudFront</title>
<meta name="author" content="kb" />
<meta name="description" content="Static Site Hosting with Amazon" />
<meta name="generator" content="Org Mode" />
<meta charset="utf-8">

<meta name="author" content="Kenny Ballou">
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">

<title>~kb</title>

<link rel="canonical" href="/" />
<link href="/index.xml" rel="alternate" type="application/rss+xml"
      title="~kb/blog" />

<link rel="stylesheet" href="/css/simple.css" />
<link rel="stylesheet" href="/css/simple.add.css" />
<link rel="stylesheet" href="/css/katex.css" />
<link rel="stylesheet" href="/css/all.min.css" />
<link rel="shortcut icon" href="/favicon.ico" type="image/x-icon" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="https://kennyballou.com/blog"> UP </a>
 |
 <a accesskey="H" href="https://kennyballou.com/"> HOME </a>
</div><header id="" class="status">
<nav>
  <a href="/">
    <i class="fade fas fa-home"></i>
  </a>
  <a href="/about.html">
    <i class="fade fas fa-user-circle"></i>
  </a>
  <a href="https://git.sr.ht/~kennyballou/"
     target="_blank"
     rel="noopener noreferrer">
    <i class="fade far fa-circle fa-1x"></i>
  </a>
  <a href="https://github.com/kennyballou"
     target="_blank"
     rel="noopener noreferrer">
    <i class="fade fab fa-github fa-1x"></i>
  </a>
  <a href="https://bitbucket.org/kballou"
     target="_blank"
     rel="noopener noreferrer">
    <i class="fade fab fa-bitbucket fa-1x"></i>
  </a>
  <a href="https://orcid.org/0000-0002-6032-474X"
     target="_blank"
     rel="noopener noreferrer">
    <i class="fade fab fa-orcid"></i>
  </a>
  <a href="https://linkedin.com/in/kennyballou"
     target="_blank"
     rel="noopener noreferrer">
    <i class="fade fab fa-linkedin-in fa-1x"></i>
  </a>
  <a href="/support.html">
    <i class="fade fas fa-heart fa-1x"></i>
  </a>
  <a href="/cv.pdf"
     target="_blank">
    <i class="fade far fa-file-pdf"></i>
  </a>
  <a href="/B74CC4B41148C3DB364BC21182D94B35744E1B34.asc"
     target="_blank">
    <i class="fade fas fa-key"></i>
  </a>
  <a href="/index.xml" rel="alternate"
     type="application/rss+xml">
    <i class="fade fas fa-rss fa-1x"></i>
  </a>
</nav>
</header>
<div id="main" class="content">
<h1 class="title">Hosting with AWS S3 and CloudFront</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgf1e4f1b">Introduction</a></li>
<li><a href="#org49ba73b">Overview</a></li>
<li><a href="#org43bf8e1">CloudFormation</a>
<ul>
<li><a href="#org45028d6">S3 Bucket</a></li>
<li><a href="#orgdcc19d8">ACM</a></li>
<li><a href="#orgdc65990">Route53</a></li>
<li><a href="#org587a096">Lambda@Edge</a></li>
<li><a href="#org6ef139a">CloudFront</a></li>
</ul>
</li>
<li><a href="#org6733737">Future Work</a></li>
<li><a href="#orgcc362cb">Cost Considerations</a></li>
<li><a href="#org70047ab">Summary</a></li>
</ul>
</div>
</div>
<div class="PREVIEW" id="orgda085e5">
<p>
There are many posts already out about how to host static sites in <a href="https://aws.amazon.com/s3/">S3</a> and
<a href="https://aws.amazon.com/cloudfront/">CloudFront</a>.  However, I would like to add to the discussion a small
contribution of how to do this by creating the resources in <a href="https://aws.amazon.com/cloudformation/">CloudFormation</a>, and
specifically, how to ensure all content is served <span class="underline">via</span> <a href="https://aws.amazon.com/cloudfront/">CloudFront</a> and is
strictly not available via <a href="https://aws.amazon.com/s3/">S3</a>.
</p>

</div>

<div id="outline-container-orgf1e4f1b" class="outline-2">
<h2 id="orgf1e4f1b">Introduction</h2>
<div class="outline-text-2" id="text-orgf1e4f1b">
<p>
There are <a href="https://vickylai.com/verbose/hosting-your-static-site-with-aws-s3-route-53-and-cloudfront/">many</a>,
<a href="https://www.davidbaumgold.com/tutorials/host-static-site-aws-s3-cloudfront/">many</a>
<a href="https://fourteenislands.io/2018/03/static-website-hosting-on-aws-with-s3-cloudfront-lambda-edge/">posts</a> on hosting static sites via
<a href="https://aws.amazon.com/s3/">S3</a> and <a href="https://aws.amazon.com/cloudfront/">CloudFront</a>.  There are even existing
<a href="https://aws.amazon.com/cloudformation/">CloudFormation templates</a>
<a href="https://rgfindl.github.io/2017/08/07/static-website-cloudformation-template/">available</a> that can be used to make this process
repeatable and consistent.
</p>

<p>
This post will simply add to this knowledge and I will attempt to capture any
notes or changes that have occurred since I ventured to migrate from managing a
virtual machine that hosts the content of this blog into <a href="https://aws.amazon.com/s3/">S3</a> served
via <a href="https://aws.amazon.com/cloudfront/">CloudFront</a>.
</p>
</div>
</div>

<div id="outline-container-org49ba73b" class="outline-2">
<h2 id="org49ba73b">Overview</h2>
<div class="outline-text-2" id="text-org49ba73b">
<p>
There has been a particular evolution to hosting static sites via <a href="https://aws.amazon.com/">AWS</a>
since the company and its offerings have changed themselves.  For example, a
few years ago, the only solution was to use <a href="https://aws.amazon.com/s3/">S3</a> directly, which
meant the <a href="https://aws.amazon.com/s3/">S3</a> bucket needed to be public and the traffic could not
be encrypted.  Then, with the introduction of <a href="https://aws.amazon.com/cloudfront/">CloudFront</a>,
it became possible to leverage Amazon's infrastructure to more readily
distribute content without making huge investments in private
<a href="https://en.wikipedia.org/wiki/Content_delivery_network">content delivery networks (CDNs)</a>, furthermore, it soon became
possible to encrypt the traffic as well.  Finally, one of the more recent
developments is the ability to have <a href="https://aws.amazon.com/lambda/">Lambda</a> functions
distributed globally with <a href="https://aws.amazon.com/cloudfront/">CloudFront</a>, making it possible to
customize or more appropriate serve the desired content.  This blog uses these
<a href="https://aws.amazon.com/lambda/edge/">Lambda@Edge</a> functions to help serve content via
<a href="https://aws.amazon.com/cloudfront/">CloudFront</a> with the files residing in <a href="https://aws.amazon.com/s3/">S3</a>.
</p>

<p>
The necessity of the <a href="https://aws.amazon.com/lambda/edge/">Lambda@Edge</a> functionallity is
properly motivated by <a href="https://aws.amazon.com/s3/">S3</a>'s inability to set default documents for
each directory.  For example, if we want to serve a post like
<code>https://example.com/blog/year/month/post-slug/</code>, we are unable to since there
is no object in <a href="https://aws.amazon.com/s3/">S3</a> by that "key".  Therefore, we can use the
<a href="https://aws.amazon.com/lambda/edge/">Lambda</a> function to rewrite the URL from
<a href="https://aws.amazon.com/cloudfront/">CloudFront</a> between <a href="https://aws.amazon.com/s3/">S3</a> to retreive the
<code>index.html</code> or <code>/index.html</code> object of the folder correctly.
</p>

<p>
Another change from other posts is that this set of configuration will force
the content to be served from <a href="https://aws.amazon.com/cloudfront/">CloudFront</a>.  It will not be,
or at least should not be, possible to access the content from the
<a href="https://aws.amazon.com/s3/">S3</a> bucket directly.  This serves a few purposes, the bucket does
not have to be public in any way, therefore, accidental write access is not
possible by acciendental misconfiguration.  Furthermore, all content can be
served quickly and securely because of the configuration of
<a href="https://aws.amazon.com/cloudfront/">CloudFront</a>.
</p>
</div>
</div>

<div id="outline-container-org43bf8e1" class="outline-2">
<h2 id="org43bf8e1">CloudFormation</h2>
<div class="outline-text-2" id="text-org43bf8e1">
<p>
We'll briefly go through the various resources needed for hosting a static site
via <a href="https://aws.amazon.com/s3/">S3</a> and <a href="https://aws.amazon.com/cloudfront/">CloudFront</a>.
</p>
</div>
