posts/hosting-with-aws-s3-cloudfront.org
*** S3 Bucket
    :PROPERTIES:
    :ID:       ebaf5cd3-43ff-4b04-93ce-423928bae5e2
    :END:

Obviously, we will need a bucket to house the content.

#+begin_src json
"BlogContentBucket": {
    "Type": "AWS::S3::Bucket",
    "Properties": {
        "AccessControl": "Private",
        "BucketName": {"Ref": "BlogBucketName"},
        "LifecycleConfiguration": {
            "Rules": [
                {
                    "NoncurrentVersionExpirationInDays": 90,
                    "Status": "Enabled"
                }
            ]
        },
        "VersioningConfiguration": {
            "Status": "Enabled"
        },
        "WebsiteConfiguration": {
            "IndexDocument": "index.html",
            "ErrorDocument": "404.html"
        }
    }
}
#+end_src

#+begin_quote
I have added a lifecycle policy to automatically remove older versions after 90
days.  Feel free to remove or change this as desired.
#+end_quote

We also want to make sure that the [[aws-cloudfront][CloudFront]] distribution
will be the only resource (other than ourselves) that can access objects from
the bucket.  Therefore, we need to setup a bucket policy and an Origin Access
ID.

#+begin_src json
"OriginAccessId": {
    "Type": "AWS::CloudFront::CloudFrontOriginAccessIdentity",
    "Properties": {
        "CloudFrontOriginAccessIdentityConfig": {
            "Comment": "S3 Bucket Access"
        }
    }
},
"BlogContentBucketPolicy": {
    "Type": "AWS::S3::BucketPolicy",
    "Properties": {
        "Bucket": {"Ref": "BlogContentBucket"},
        "PolicyDocument": {
            "Statement": [
                {
                    "Action": ["s3:GetObject"],
                    "Effect": "Allow",
                    "Resource": [
                        {"Fn::Join": ["/", [
                            {"Fn::GetAtt": [
                                "BlogContentBucket", "Arn"]},
                            "*"
                        ]]}
                    ],
                    "Principal": {
                        "CanonicalUser": {"Fn::GetAtt": [
                            "OriginAccessId",
                            "S3CanonicalUserId"]}
                    }
                }
            ]
        }
    }
}
#+end_src

*** ACM
    :PROPERTIES:
    :ID:       1d215d6c-acce-49cb-b5ca-058cb3483eca
    :END:

[[aws-acm][AWS Certificate Manager]] offers free certificates and these can be
used with [[aws-cloudfront][CloudFront]] pretty trivially, so we will set up
this resource as well.

#+begin_src json
"SSLCertificate": {
    "Type": "AWS::CertificateManager::Certificate",
    "Properties": {
        "DomainName": {"Ref": "DomainName"}
    }
}
#+end_src

Ideally the validation could be done via DNS validation, however, this can be
tricky when done via [[aws-cloudformation][CloudFormation]].

*** Route53
    :PROPERTIES:
    :ID:       0c853a1a-915f-41fe-93e3-51207dfa0afe
    :END:

Since this blog is hosted under the "naked" domain, it's best to use
[[aws-route53][Route53]] for mapping the alias of
[[aws-cloudfront][CloudFront]] to the [[wiki-dns-records][=A=]] record of the
domain.  Therefore, we will create the hosted zone and then an alias record set
in the freshly created hosted zone.

#+begin_src json
"HostedZone": {
    "Type": "AWS::Route53::HostedZone",
    "Properties": {
        "Name": {"Ref": "DomainName"}
    }
}
#+end_src

#+begin_src json
"BlogAliasRecord": {
    "Type": "AWS::Route53::RecordSet",
    "Properties": {
        "AliasTarget": {
            "DNSName": {"Fn::GetAtt": ["CFDistribution", "DomainName"]},
            "HostedZoneId": {"Ref": "CloudFrontHostedZone"}
        },
        "HostedZoneId": {"Ref": "HostedZone"},
        "Name": {"Ref": "DomainName"},
        "Type": "A"
    }
}
#+end_src

If using a non-naked domain, such as =www=, this could defined to be a
[[wiki-cname-records][=CNAME=]] record to the [[aws-cloudfront][CloudFront]]
distribution.

