blog/2020/02/hosting-with-aws-s3-cloudfront/index.html

<div id="outline-container-org45028d6" class="outline-3">
<h3 id="org45028d6">S3 Bucket</h3>
<div class="outline-text-3" id="text-org45028d6">
<p>
Obviously, we will need a bucket to house the content.
</p>

<div class="org-src-container">
<pre class="src src-json">"BlogContentBucket": {
    "Type": "AWS::S3::Bucket",
    "Properties": {
        "AccessControl": "Private",
        "BucketName": {"Ref": "BlogBucketName"},
        "LifecycleConfiguration": {
            "Rules": [
                {
                    "NoncurrentVersionExpirationInDays": 90,
                    "Status": "Enabled"
                }
            ]
        },
        "VersioningConfiguration": {
            "Status": "Enabled"
        },
        "WebsiteConfiguration": {
            "IndexDocument": "index.html",
            "ErrorDocument": "404.html"
        }
    }
}
</pre>
</div>

<blockquote>
<p>
I have added a lifecycle policy to automatically remove older versions after 90
days.  Feel free to remove or change this as desired.
</p>
</blockquote>

<p>
We also want to make sure that the <a href="https://aws.amazon.com/cloudfront/">CloudFront</a> distribution
will be the only resource (other than ourselves) that can access objects from
the bucket.  Therefore, we need to setup a bucket policy and an Origin Access
ID.
</p>

<div class="org-src-container">
<pre class="src src-json">"OriginAccessId": {
    "Type": "AWS::CloudFront::CloudFrontOriginAccessIdentity",
    "Properties": {
        "CloudFrontOriginAccessIdentityConfig": {
            "Comment": "S3 Bucket Access"
        }
    }
},
"BlogContentBucketPolicy": {
    "Type": "AWS::S3::BucketPolicy",
    "Properties": {
        "Bucket": {"Ref": "BlogContentBucket"},
        "PolicyDocument": {
            "Statement": [
                {
                    "Action": ["s3:GetObject"],
                    "Effect": "Allow",
                    "Resource": [
                        {"Fn::Join": ["/", [
                            {"Fn::GetAtt": [
                                "BlogContentBucket", "Arn"]},
                            "*"
                        ]]}
                    ],
                    "Principal": {
                        "CanonicalUser": {"Fn::GetAtt": [
                            "OriginAccessId",
                            "S3CanonicalUserId"]}
                    }
                }
            ]
        }
    }
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgdcc19d8" class="outline-3">
<h3 id="orgdcc19d8">ACM</h3>
<div class="outline-text-3" id="text-orgdcc19d8">
<p>
<a href="https://aws.amazon.com/acm/">AWS Certificate Manager</a> offers free certificates and these can be
used with <a href="https://aws.amazon.com/cloudfront/">CloudFront</a> pretty trivially, so we will set up
this resource as well.
</p>

<div class="org-src-container">
<pre class="src src-json">"SSLCertificate": {
    "Type": "AWS::CertificateManager::Certificate",
    "Properties": {
        "DomainName": {"Ref": "DomainName"}
    }
}
</pre>
</div>

<p>
Ideally the validation could be done via DNS validation, however, this can be
tricky when done via <a href="https://aws.amazon.com/cloudformation/">CloudFormation</a>.
</p>
</div>
</div>

<div id="outline-container-orgdc65990" class="outline-3">
<h3 id="orgdc65990">Route53</h3>
<div class="outline-text-3" id="text-orgdc65990">
<p>
Since this blog is hosted under the "naked" domain, it's best to use
<a href="https://aws.amazon.com/route53/">Route53</a> for mapping the alias of
<a href="https://aws.amazon.com/cloudfront/">CloudFront</a> to the <a href="https://en.wikipedia.org/wiki/List_of_DNS_record_types"><code>A</code></a> record of the
domain.  Therefore, we will create the hosted zone and then an alias record set
in the freshly created hosted zone.
</p>

<div class="org-src-container">
<pre class="src src-json">"HostedZone": {
    "Type": "AWS::Route53::HostedZone",
    "Properties": {
        "Name": {"Ref": "DomainName"}
    }
}
</pre>
</div>

<div class="org-src-container">
<pre class="src src-json">"BlogAliasRecord": {
    "Type": "AWS::Route53::RecordSet",
    "Properties": {
        "AliasTarget": {
            "DNSName": {"Fn::GetAtt": ["CFDistribution", "DomainName"]},
            "HostedZoneId": {"Ref": "CloudFrontHostedZone"}
        },
        "HostedZoneId": {"Ref": "HostedZone"},
        "Name": {"Ref": "DomainName"},
        "Type": "A"
    }
}
</pre>
</div>

<p>
If using a non-naked domain, such as <code>www</code>, this could defined to be a
<a href="https://en.wikipedia.org/wiki/CNAME_record"><code>CNAME</code></a> record to the <a href="https://aws.amazon.com/cloudfront/">CloudFront</a>
distribution.
</p>
</div>
</div>
