posts/hosting-with-aws-s3-cloudfront.org
*** Lambda@Edge
    :PROPERTIES:
    :ID:       88bef35c-ad18-4b01-91c8-33fa579f696f
    :END:

Of all the resources, this will actually be the most complicated.

First, we need to create a role and policy for the function's permissions.

#+begin_src json
"URIRewriteLambdaRole": {
    "Type": "AWS::IAM::Role",
    "Properties": {
        "AssumeRolePolicyDocument": {
            "Version": "2012-10-17",
            "Statement": [
                {
                    "Effect": "Allow",
                    "Action": "sts:AssumeRole",
                    "Principal": {
                        "Service": [
                            "edgelambda.amazonaws.com",
                            "lambda.amazonaws.com"
                        ]
                    }
                }
            ]
        },
        "Policies": [
            {
                "PolicyName": "GrantCloudwatchLogAccess",
                "PolicyDocument": {
                    "Version": "2012-10-17",
                    "Statement": [
                        {
                            "Effect": "Allow",
                            "Action": [
                                "logs:CreateLogGroup",
                                "logs:CreateLogStream",
                                "logs:PutLogEvents"
                            ],
                            "Resource": [
                                "*"
                            ]
                        }
                    ]
                }
            }
        ]
    }
}
#+end_src

#+begin_quote
Restricting the permissions is possible, but requires that the role is first
created with more open permissions since it is not possible to directly tell a
[[aws-lambda][Lambda]] function to use a specific [[aws-cw-logs][LogGroup]].
See this [[blog-infra-uri-log-group-commit][commit]] for more information.
#+end_quote

Next, we can create the [[aws-lambda][Lambda]] function resource.

#+begin_src json
"URIRewriteLambdaFunction": {
    "Type": "AWS::Lambda::Function",
    "Properties": {
        "Description": "Lambda Function performing URI rewriting",
        "Code": {
            "ZipFile": {"Fn::Join": ["\n", [
                "def handler(event, _context):",
                "    whitelist = [",
                "        'asc',",
                "        'css',",
                "        'gif',",
                "        'html',",
                "        'ico',",
                "        'jpeg',",
                "        'jpg',",
                "        'js',",
                "        'json',",
                "        'map',",
                "        'md',",
                "        'ogg',",
                "        'pdf',",
                "        'png',",
                "        'pug',",
                "        'sass',",
                "        'scss',",
                "        'svg',",
                "        'txt',",
                "        'xml',",
                "    ]",
                "    request = event['Records'][0]['cf']['request']",
                "    extension = request['uri'].split('.')[-1]",
                "    if extension is None or extension not in whitelist:",
                "        if request['uri'][-1] == '/':",
                "            request['uri'] += 'index.html'",
                "        else:",
                "            request['uri'] += '/index.html'",
                "    return request"
            ]]}

        },
        "Handler": "index.handler",
        "MemorySize": 128,
        "Role": {"Fn::GetAtt": ["URIRewriteLambdaRole", "Arn"]},
        "Runtime": "python3.7",
        "Tags": [
            {"Key": "Domain", "Value": {"Ref": "DomainName"}}
        ]
    }
}
#+end_src

Fairly [[aws-announce-lambda-python][recently]], [[python][Python]] 3.7 became
available for [[aws-lambda-edge][Lambda@Edge]].

A benefit of using [[python][Python]] [[aws-lambda][Lambda]] runtime is that it
still supports directly uploading code to the function via the "ZipFile" key.

#+begin_quote
Notice, this function is easy enough that directly wrapping it into JSON isn't
too bad.  However, a better approach under development is a simple utility that
can perform the encoding at build time.  A future post, perhaps.
#+end_quote

Finally, to associate the function with [[aws-cloudfront][CloudFront]], we need
to create a "version" alias of the function.

#+begin_src json
"URIRewriteLambdaVersion": {
    "Type": "AWS::Lambda::Version",
    "Properties": {
        "FunctionName": {"Fn::GetAtt": [
            "URIRewriteLambdaFunction", "Arn"]},
        "Description": "Lambda Function performing URI rewriting"
    }
}
#+end_src

*** CloudFront
    :PROPERTIES:
    :ID:       f0296b7b-c42b-4c29-94ef-a9d8d0961838
    :END:

Finally, we can put everything together into the [[aws-cloudfront][CloudFront]]
Distribution.

#+begin_src json
"CFDistribution": {
    "Type": "AWS::CloudFront::Distribution",
    "Properties": {
        "DistributionConfig": {
            "Aliases": [
                {"Ref": "DomainName"}
            ],
            "DefaultRootObject": "index.html",
            "Enabled": true,
            "IPV6Enabled": true,
            "HttpVersion": "http2",
            "DefaultCacheBehavior": {
                "TargetOriginId": {"Fn::Join": [".", [
                    "s3",
                    {"Ref": "BlogBucketName"}]]},
                "ViewerProtocolPolicy": "redirect-to-https",
                "MinTTL": 0,
                "DefaultTTL": 3600,
                "AllowedMethods": ["HEAD", "GET"],
                "CachedMethods": ["HEAD", "GET"],
                "ForwardedValues": {
                    "QueryString": true,
                    "Cookies": {
                        "Forward": "none"
                    }
                },
                "LambdaFunctionAssociations": [
                    {
                        "EventType": "origin-request",
                        "LambdaFunctionARN": {
                            "Ref": "URIRewriteLambdaVersion"
                        }
                    }
                ]
            },
            "Origins": [
                {
                    "S3OriginConfig": {
                        "OriginAccessIdentity": {"Fn::Join": ["/", [
                            "origin-access-identity/cloudfront",
                            {"Ref": "OriginAccessId"}
                        ]]}
                    },
                    "DomainName": {"Fn::Join": [".", [
                        {"Ref": "BlogBucketName"},
                        "s3.amazonaws.com"]]},
                    "Id": {"Fn::Join": [".", [
                        "s3",
                        {"Ref": "BlogBucketName"}]]}
                }
            ],
            "PriceClass": "PriceClass_100",
            "Restrictions": {
                "GeoRestriction": {
                    "RestrictionType": "none",
                    "Locations": []
                }
            },
            "ViewerCertificate": {
                "SslSupportMethod": "sni-only",
                "MinimumProtocolVersion": "TLSv1.2_2018",
                "AcmCertificateArn": {"Ref": "SSLCertificate"}
            }
        }
    }
}
#+end_src

