blog/2020/02/hosting-with-aws-s3-cloudfront/index.html

<div id="outline-container-org587a096" class="outline-3">
<h3 id="org587a096">Lambda@Edge</h3>
<div class="outline-text-3" id="text-org587a096">
<p>
Of all the resources, this will actually be the most complicated.
</p>

<p>
First, we need to create a role and policy for the function's permissions.
</p>

<div class="org-src-container">
<pre class="src src-json">"URIRewriteLambdaRole": {
    "Type": "AWS::IAM::Role",
    "Properties": {
        "AssumeRolePolicyDocument": {
            "Version": "2012-10-17",
            "Statement": [
                {
                    "Effect": "Allow",
                    "Action": "sts:AssumeRole",
                    "Principal": {
                        "Service": [
                            "edgelambda.amazonaws.com",
                            "lambda.amazonaws.com"
                        ]
                    }
                }
            ]
        },
        "Policies": [
            {
                "PolicyName": "GrantCloudwatchLogAccess",
                "PolicyDocument": {
                    "Version": "2012-10-17",
                    "Statement": [
                        {
                            "Effect": "Allow",
                            "Action": [
                                "logs:CreateLogGroup",
                                "logs:CreateLogStream",
                                "logs:PutLogEvents"
                            ],
                            "Resource": [
                                "*"
                            ]
                        }
                    ]
                }
            }
        ]
    }
}
</pre>
</div>

<blockquote>
<p>
Restricting the permissions is possible, but requires that the role is first
created with more open permissions since it is not possible to directly tell a
<a href="https://aws.amazon.com/lambda/">Lambda</a> function to use a specific <a href="https://docs.aws.amazon.com/AmazonCloudWatch/latest/logs/WhatIsCloudWatchLogs.html">LogGroup</a>.
See this <a href="https://git.devnulllabs.io/kennyballou.com.git/commit/?id=787ab0b4b18003875346c7f9e98f1b2264fded46">commit</a> for more information.
</p>
</blockquote>

<p>
Next, we can create the <a href="https://aws.amazon.com/lambda/">Lambda</a> function resource.
</p>

<div class="org-src-container">
<pre class="src src-json">"URIRewriteLambdaFunction": {
    "Type": "AWS::Lambda::Function",
    "Properties": {
        "Description": "Lambda Function performing URI rewriting",
        "Code": {
            "ZipFile": {"Fn::Join": ["\n", [
                "def handler(event, _context):",
                "    whitelist = [",
                "        'asc',",
                "        'css',",
                "        'gif',",
                "        'html',",
                "        'ico',",
                "        'jpeg',",
                "        'jpg',",
                "        'js',",
                "        'json',",
                "        'map',",
                "        'md',",
                "        'ogg',",
                "        'pdf',",
                "        'png',",
                "        'pug',",
                "        'sass',",
                "        'scss',",
                "        'svg',",
                "        'txt',",
                "        'xml',",
                "    ]",
                "    request = event['Records'][0]['cf']['request']",
                "    extension = request['uri'].split('.')[-1]",
                "    if extension is None or extension not in whitelist:",
                "        if request['uri'][-1] == '/':",
                "            request['uri'] += 'index.html'",
                "        else:",
                "            request['uri'] += '/index.html'",
                "    return request"
            ]]}

        },
        "Handler": "index.handler",
        "MemorySize": 128,
        "Role": {"Fn::GetAtt": ["URIRewriteLambdaRole", "Arn"]},
        "Runtime": "python3.7",
        "Tags": [
            {"Key": "Domain", "Value": {"Ref": "DomainName"}}
        ]
    }
}
</pre>
</div>

<p>
Fairly <a href="https://aws.amazon.com/about-aws/whats-new/2019/08/lambdaedge-adds-support-for-python-37/">recently</a>, <a href="https://www.python.org/">Python</a> 3.7 became
available for <a href="https://aws.amazon.com/lambda/edge/">Lambda@Edge</a>.
</p>

<p>
A benefit of using <a href="https://www.python.org/">Python</a> <a href="https://aws.amazon.com/lambda/">Lambda</a> runtime is that it
still supports directly uploading code to the function via the "ZipFile" key.
</p>

<blockquote>
<p>
Notice, this function is easy enough that directly wrapping it into JSON isn't
too bad.  However, a better approach under development is a simple utility that
can perform the encoding at build time.  A future post, perhaps.
</p>
</blockquote>

<p>
Finally, to associate the function with <a href="https://aws.amazon.com/cloudfront/">CloudFront</a>, we need
to create a "version" alias of the function.
</p>

<div class="org-src-container">
<pre class="src src-json">"URIRewriteLambdaVersion": {
    "Type": "AWS::Lambda::Version",
    "Properties": {
        "FunctionName": {"Fn::GetAtt": [
            "URIRewriteLambdaFunction", "Arn"]},
        "Description": "Lambda Function performing URI rewriting"
    }
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org6ef139a" class="outline-3">
<h3 id="org6ef139a">CloudFront</h3>
<div class="outline-text-3" id="text-org6ef139a">
<p>
Finally, we can put everything together into the <a href="https://aws.amazon.com/cloudfront/">CloudFront</a>
Distribution.
</p>

<div class="org-src-container">
<pre class="src src-json">"CFDistribution": {
    "Type": "AWS::CloudFront::Distribution",
    "Properties": {
        "DistributionConfig": {
            "Aliases": [
                {"Ref": "DomainName"}
            ],
            "DefaultRootObject": "index.html",
            "Enabled": true,
            "IPV6Enabled": true,
            "HttpVersion": "http2",
            "DefaultCacheBehavior": {
                "TargetOriginId": {"Fn::Join": [".", [
                    "s3",
                    {"Ref": "BlogBucketName"}]]},
                "ViewerProtocolPolicy": "redirect-to-https",
                "MinTTL": 0,
                "DefaultTTL": 3600,
                "AllowedMethods": ["HEAD", "GET"],
                "CachedMethods": ["HEAD", "GET"],
                "ForwardedValues": {
                    "QueryString": true,
                    "Cookies": {
                        "Forward": "none"
                    }
                },
                "LambdaFunctionAssociations": [
                    {
                        "EventType": "origin-request",
                        "LambdaFunctionARN": {
                            "Ref": "URIRewriteLambdaVersion"
                        }
                    }
                ]
            },
            "Origins": [
                {
                    "S3OriginConfig": {
                        "OriginAccessIdentity": {"Fn::Join": ["/", [
                            "origin-access-identity/cloudfront",
                            {"Ref": "OriginAccessId"}
                        ]]}
                    },
                    "DomainName": {"Fn::Join": [".", [
                        {"Ref": "BlogBucketName"},
                        "s3.amazonaws.com"]]},
                    "Id": {"Fn::Join": [".", [
                        "s3",
                        {"Ref": "BlogBucketName"}]]}
                }
            ],
            "PriceClass": "PriceClass_100",
            "Restrictions": {
                "GeoRestriction": {
                    "RestrictionType": "none",
                    "Locations": []
                }
            },
            "ViewerCertificate": {
                "SslSupportMethod": "sni-only",
                "MinimumProtocolVersion": "TLSv1.2_2018",
                "AcmCertificateArn": {"Ref": "SSLCertificate"}
            }
        }
    }
}
</pre>
</div>
</div>
</div>
</div>
