posts/hosting-with-aws-s3-cloudfront.org
** Future Work
   :PROPERTIES:
   :ID:       1e2a2710-27c9-4279-87f5-a1fdd4ae6e86
   :END:

The [[aws-cfn][CloudFormation]] template is not perfect.  For example, I
personally would like to have the ability to create [[aws-acm][Certificates]]
with Domain Validation via [[aws-cfn][CloudFormation]], however, this does not,
last I have checked, appear to be possible because of timing issues.

Another future feature could be to setup automatic build and deployments of the
content to the bucket using more [[aws][AWS]] services.

** Cost Considerations
   :PROPERTIES:
   :ID:       94a139d8-42c5-4f1b-a736-c15e790d7ef0
   :END:

[[aws][AWS]] is not known to be inexpensive.  Arguably, their entire business
is built around the very fact that just about every service within [[aws][AWS]]
has a level of accounting unheard of elsewhere.  That said, this blog has
relatively low traffic.  Therefore, the most expensive aspect of hosting it
right now is the hosted zone charge.  The [[aws-lambda][Lambda]] and
[[aws-cloudfront][CloudFront]] accounts for measly 9% of the charges.

However, if the content is very exciting or gathers a larger following, this
can and _will_ go up.  For example, hosting a few hundred sites in a different
[[aws][AWS]] via [[aws-cloudfront][CloudFront]] (not as described here), the
cost is measured in hundreds of dollars.

Overall, it made the most cost sense for this blog's application.  It may not
for others.

** Summary
   :PROPERTIES:
   :ID:       eb3dc199-e208-42cf-a460-90fccda928a6
   :END:

It is the goal of this post to further describe how to host a static site in
[[aws][AWS]] using a few services that can make for _really_ inexpensive
hosting.

The code/template discussed for this blog is available
[[blog-infra-git][online]].  I hope it can be useful to others and I encourage
its usage or replication.  Of course, if there are any issues with it, please
let me know.
