blog/2020/02/hosting-with-aws-s3-cloudfront/index.html

<div id="outline-container-org6733737" class="outline-2">
<h2 id="org6733737">Future Work</h2>
<div class="outline-text-2" id="text-org6733737">
<p>
The <a href="https://aws.amazon.com/cloudformation/">CloudFormation</a> template is not perfect.  For
example, I personally would like to have the ability to create
<a href="https://aws.amazon.com/acm/">Certificates</a> with Domain Validation via
<a href="https://aws.amazon.com/cloudformation/">CloudFormation</a>, however, this does not, last I have
checked, appear to be possible because of timing issues.
</p>

<p>
Another future feature could be to setup automatic build and deployments of the
content to the bucket using more <a href="https://aws.amazon.com/">AWS</a> services.
</p>
</div>
</div>

<div id="outline-container-orgcc362cb" class="outline-2">
<h2 id="orgcc362cb">Cost Considerations</h2>
<div class="outline-text-2" id="text-orgcc362cb">
<p>
<a href="https://aws.amazon.com/">AWS</a> is not known to be inexpensive.  Arguably, their entire business
is built around the very fact that just about every service within <a href="https://aws.amazon.com/">AWS</a>
has a level of accounting unheard of elsewhere.  That said, this blog has
relatively low traffic.  Therefore, the most expensive aspect of hosting it
right now is the hosted zone charge.  The <a href="https://aws.amazon.com/lambda/">Lambda</a> and
<a href="https://aws.amazon.com/cloudfront/">CloudFront</a> accounts for measly 9% of the charges.
</p>

<p>
However, if the content is very exciting or gathers a larger following, this
can and <span class="underline">will</span> go up.  For example, hosting a few hundred sites in a different
<a href="https://aws.amazon.com/">AWS</a> via <a href="https://aws.amazon.com/cloudfront/">CloudFront</a> (not as described here), the
cost is measured in hundreds of dollars.
</p>

<p>
Overall, it made the most cost sense for this blog's application.  It may not
for others.
</p>
</div>
</div>

<div id="outline-container-org70047ab" class="outline-2">
<h2 id="org70047ab">Summary</h2>
<div class="outline-text-2" id="text-org70047ab">
<p>
It is the goal of this post to further describe how to host a static site in
<a href="https://aws.amazon.com/">AWS</a> using a few services that can make for <span class="underline">really</span> inexpensive
hosting.
</p>

<p>
The code/template discussed for this blog is available
<a href="https://git.devnulllabs.io/kennyballou.com.git/">online</a>.  I hope it can be useful to others and I encourage
its usage or replication.  Of course, if there are any issues with it, please
let me know.
</p>
</div>
</div>
</div>
<footer id="" class="status">
<footer>
  <p>&copy; 2014-2025 Kenny Ballou.
    <a href="http://creativecommons.org/licenses/by-nc-sa/4.0/">Some rights
      reserved.</a></p>
  <p>Powered by <a href="https://gnu.org">GNU/Linux</a></p>
</footer>
</footer>
</body>
</html>
